import numpy as np
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense
import tensorflow as tf
import random

random.seed(333)
np.random.seed(333)
tf.random.set_seed(333)

from keras.applications import VGG16
#2.모델 
# model = VGG16()
###디폴트####
model = VGG16(
    # weights= 'imagenet',
    include_top=False, #풀리커넥티드 레이어 날라가고 컨볼루션 층만 남음
    input_shape=(32,32,3)
)
model.summary()
'''###############vgg16 기본모델###############
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┓
┃ Layer (type)                ┃ Output Shape        ┃     Param # ┃
┡━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━┩
│ input_layer (InputLayer)    │ (None, 224, 224, 3) │           0 │
├─────────────────────────────┼─────────────────────┼─────────────┤
│
├─────────────────────────────┼─────────────────────┼─────────────┤
│ predictions (Dense)         │ (None, 1000)        │   4,097,000 │
└─────────────────────────────┴─────────────────────┴─────────────┘
 Total params: 138,357,544 (527.79 MB)
 Trainable params: 138,357,544 (527.79 MB)
 Non-trainable params: 0 (0.00 B)

 
 #####################include_top (False)#############
 ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┓
┃ Layer (type)                ┃ Output Shape        ┃     Param # ┃
┡━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━┩
│ input_layer (InputLayer)    │ (None, 100, 100, 3) │           0 │
├─────────────────────────────┼─────────────────────┼─────────────┤
│ block1_conv1 (Conv2D)       │ (None, 100, 100,    │       1,792 │
│                             │ 64)                 │             │
├─────────────────────────────┼─────────────────────┼─────────────┤
│ block1_conv2 (Conv2D)       │ (None, 100, 100,    │      36,928 │
│                             │ 64)                 │             │
├─────────────────────────────┼─────────────────────┼─────────────┤
│ block1_pool (MaxPooling2D)  │ (None, 50, 50, 64)  │           0 │
├─────────────────────────────┼─────────────────────┼─────────────┤
│ block2_conv1 (Conv2D)       │ (None, 50, 50, 128) │      73,856 │
├─────────────────────────────┼─────────────────────┼─────────────┤
│ block2_conv2 (Conv2D)       │ (None, 50, 50, 128) │     147,584 │
├─────────────────────────────┼─────────────────────┼─────────────┤
│ block2_pool (MaxPooling2D)  │ (None, 25, 25, 128) │           0 │
├
├─────────────────────────────┼─────────────────────┼─────────────┤
│ block5_conv2 (Conv2D)       │ (None, 6, 6, 512)   │   2,359,808 │
├─────────────────────────────┼─────────────────────┼─────────────┤
│ block5_conv3 (Conv2D)       │ (None, 6, 6, 512)   │   2,359,808 │
├─────────────────────────────┼─────────────────────┼─────────────┤
│ block5_pool (MaxPooling2D)  │ (None, 3, 3, 512)   │           0 │
└─────────────────────────────┴─────────────────────┴─────────────┘
 Total params: 14,714,688 (56.13 MB)
 Trainable params: 14,714,688 (56.13 MB)
 Non-trainable params: 0 (0.00 B) 

############include_top=Flase#########
#


#전이학습
tranfer learning

feature Extraction
-사전 학습된 모델을 고정된 특징 추출기로 활용

pre-trained model
사전학습모델

사전학습 모델 기반의 파인 튜닝(Fine-tuning)


 '''